Revit 2027 API
SiteLocation.WeatherStationName Property
 The name of the weather station at the site location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string WeatherStationName { get; }
Public ReadOnly Property WeatherStationName As String
	Get
public:
property String^ WeatherStationName {
	String^ get ();
}
member WeatherStationName : string with get
Property Value
String
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace